coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/cmsis_boot/TMPM369.h
/* UDC2 AHB Bridge */
#define TSB_EM_IFCR_IOTOUT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFCR,8)))
#define TSB_EM_IFCR_DMATOUT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFCR,9)))
#define TSB_EM_IFCR_DMAERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFCR,10)))
#define TSB_EM_IFINTST_EMDMACINT                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,0)))
#define TSB_EM_IFINTST_SLAVE0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,8)))
#define TSB_EM_IFINTST_SLAVE1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,9)))
#define TSB_EM_IFINTST_SLAVE2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,10)))
#define TSB_EM_IFINTST_SLAVE3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,11)))
#define TSB_EM_IFINTST_IOTOUT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,15)))
#define TSB_EM_IFINTST_MASTER0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,16)))
#define TSB_EM_IFINTST_MASTER1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,17)))
#define TSB_EM_IFINTST_MASTER2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,18)))
#define TSB_EM_IFINTST_DMATOUT                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTST,23)))
#define TSB_EM_IFINTEN_EMDMACINT                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,0)))
#define TSB_EM_IFINTEN_SLAVE0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,8)))
#define TSB_EM_IFINTEN_SLAVE1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,9)))
#define TSB_EM_IFINTEN_SLAVE2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,10)))
#define TSB_EM_IFINTEN_SLAVE3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,11)))
#define TSB_EM_IFINTEN_IOTOUT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,15)))
#define TSB_EM_IFINTEN_MASTER0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,16)))
#define TSB_EM_IFINTEN_MASTER1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,17)))
#define TSB_EM_IFINTEN_MASTER2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,18)))
#define TSB_EM_IFINTEN_DMATOUT                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->IFINTEN,23)))
#define TSB_EM_DCR_SWR                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DCR,0)))
#define TSB_EM_DCR_DE                             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DCR,6)))
#define TSB_EM_DTEN_TRNS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DTEN,0)))
#define TSB_EM_DREN_RCV                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DREN,0)))
#define TSB_EM_DINTST_RINT1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,0)))
#define TSB_EM_DINTST_RINT2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,1)))
#define TSB_EM_DINTST_RINT3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,2)))
#define TSB_EM_DINTST_RINT4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,3)))
#define TSB_EM_DINTST_RINT5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,4)))
#define TSB_EM_DINTST_RINT8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,7)))
#define TSB_EM_DINTST_TINT1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,8)))
#define TSB_EM_DINTST_TINT2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,9)))
#define TSB_EM_DINTST_TINT3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,10)))
#define TSB_EM_DINTST_TINT4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,11)))
#define TSB_EM_DINTST_RFE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,16)))
#define TSB_EM_DINTST_RDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,17)))
#define TSB_EM_DINTST_FRC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,18)))
#define TSB_EM_DINTST_TFE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,19)))
#define TSB_EM_DINTST_TDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,20)))
#define TSB_EM_DINTST_FTC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,21)))
#define TSB_EM_DINTST_MINT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,22)))
#define TSB_EM_DINTST_BER                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,23)))
#define TSB_EM_DINTST_RFRMER                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,24)))
#define TSB_EM_DINTST_RABT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,25)))
#define TSB_EM_DINTST_TABT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,26)))
#define TSB_EM_DINTST_TWB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTST,30)))
#define TSB_EM_DINTEN_RINT1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,0)))
#define TSB_EM_DINTEN_RINT2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,1)))
#define TSB_EM_DINTEN_RINT3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,2)))
#define TSB_EM_DINTEN_RINT4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,3)))
#define TSB_EM_DINTEN_RINT5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,4)))
#define TSB_EM_DINTEN_RINT8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,7)))
#define TSB_EM_DINTEN_TINT1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,8)))
#define TSB_EM_DINTEN_TINT2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,9)))
#define TSB_EM_DINTEN_TINT3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,10)))
#define TSB_EM_DINTEN_TINT4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,11)))
#define TSB_EM_DINTEN_RFE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,16)))
#define TSB_EM_DINTEN_RDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,17)))
#define TSB_EM_DINTEN_FRC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,18)))
#define TSB_EM_DINTEN_TFE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,19)))
#define TSB_EM_DINTEN_TDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,20)))
#define TSB_EM_DINTEN_FTC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,21)))
#define TSB_EM_DINTEN_MINT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,22)))
#define TSB_EM_DINTEN_BER                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,23)))
#define TSB_EM_DINTEN_RFRMER                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,24)))
#define TSB_EM_DINTEN_RABT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,25)))
#define TSB_EM_DINTEN_TABT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,26)))
#define TSB_EM_DINTEN_TWB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DINTEN,30)))
#define TSB_EM_DERR_RINT1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,0)))
#define TSB_EM_DERR_RINT2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,1)))
#define TSB_EM_DERR_RINT3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,2)))
#define TSB_EM_DERR_RINT4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,3)))
#define TSB_EM_DERR_RINT5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,4)))
#define TSB_EM_DERR_RINT8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,7)))
#define TSB_EM_DERR_TINT1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,8)))
#define TSB_EM_DERR_TINT2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,9)))
#define TSB_EM_DERR_TINT3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,10)))
#define TSB_EM_DERR_TINT4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DERR,11)))
#define TSB_EM_DRRCR_RR                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DRRCR,0)))
#define TSB_EM_DRRCR_RNR                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DRRCR,1)))
#define TSB_EM_DTIMER_TIS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DTIMER,0)))
#define TSB_EM_DTIMER_TIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->DTIMER,4)))
#define TSB_EM_CCR_PRM                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,0)))
#define TSB_EM_CCR_DPM                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,1)))
#define TSB_EM_CCR_OLB                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,2)))
#define TSB_EM_CCR_ILB                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,3)))
#define TSB_EM_CCR_TPE                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,5)))
#define TSB_EM_CCR_RPE                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,6)))
#define TSB_EM_CCR_MPM                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,9)))
#define TSB_EM_CCR_CER                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,12)))
#define TSB_EM_CCR_TXF                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,16)))
#define TSB_EM_CCR_RXF                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,17)))
#define TSB_EM_CCR_PFR                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,18)))
#define TSB_EM_CCR_TPF                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,19)))
#define TSB_EM_CCR_TPC                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CCR,20)))
#define TSB_EM_CINTST_FCIDTCT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTST,0)))
#define TSB_EM_CINTST_MAGICPKT                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTST,1)))
#define TSB_EM_CINTST_LINKCHNG                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTST,2)))
#define TSB_EM_CINTST_PSRTROV                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTST,4)))
#define TSB_EM_CINTST_BRDSRCV                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTST,5)))
#define TSB_EM_CINTEN_FCIDTCT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTEN,0)))
#define TSB_EM_CINTEN_MAGICPKT                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTEN,1)))
#define TSB_EM_CINTEN_LINKCHNG                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTEN,2)))
#define TSB_EM_CINTEN_PSRTROV                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTEN,4)))
#define TSB_EM_CINTEN_BRDSRCV                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CINTEN,5)))
#define TSB_EM_CMIICR_MDC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CMIICR,0)))
#define TSB_EM_CMIICR_MMD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CMIICR,1)))
#define TSB_EM_CMIICR_MDO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CMIICR,2)))
#define TSB_EM_CMIICR_MDI                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EM->CMIICR,3)))
#define TSB_EM_CPHYST_LINK                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EM->CPHYST,0)))


/* Synchronous Serial Port */
#define TSB_SSP0_SR_TFE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,0)))
#define TSB_SSP0_SR_TNF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,1)))
#define TSB_SSP0_SR_RNE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,2)))
#define TSB_SSP0_SR_RFF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,3)))
#define TSB_SSP0_SR_BSY                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,4)))
#define TSB_SSP0_RIS_RORRIS                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,0)))
#define TSB_SSP0_RIS_RTRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,1)))
#define TSB_SSP0_RIS_RXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,2)))
#define TSB_SSP0_RIS_TXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,3)))
#define TSB_SSP0_MIS_RORMIS                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,0)))
#define TSB_SSP0_MIS_RTMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,1)))
#define TSB_SSP0_MIS_RXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,2)))
#define TSB_SSP0_MIS_TXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,3)))

